riraosan/ESP32_LEDMatrix_Clock/src/main.cpp
void setAllPortLow()
{
    //digitalWrite(PORT_SE_IN, LOW);
    digitalWrite(PORT_AB_IN, LOW);
    digitalWrite(PORT_A3_IN, LOW);
    digitalWrite(PORT_A2_IN, LOW);
    digitalWrite(PORT_A1_IN, LOW);
    digitalWrite(PORT_A0_IN, LOW);
    digitalWrite(PORT_DG_IN, LOW);
    digitalWrite(PORT_CLK_IN, LOW);
    digitalWrite(PORT_WE_IN, LOW);
    digitalWrite(PORT_DR_IN, LOW);
    digitalWrite(PORT_ALE_IN, LOW);
}

void setAllPortHigh()
{
    digitalWrite(PORT_SE_IN, HIGH);
    digitalWrite(PORT_AB_IN, HIGH);
    digitalWrite(PORT_A3_IN, HIGH);
    digitalWrite(PORT_A2_IN, HIGH);
    digitalWrite(PORT_A1_IN, HIGH);
    digitalWrite(PORT_A0_IN, HIGH);
    digitalWrite(PORT_DG_IN, HIGH);
    digitalWrite(PORT_CLK_IN, HIGH);
    digitalWrite(PORT_WE_IN, HIGH);
    digitalWrite(PORT_DR_IN, HIGH);
    digitalWrite(PORT_ALE_IN, HIGH);
}

void PrintTime(String &str, int flag)
{
    char tmp_str[10] = {0};
    struct tm *tm;

    time_t t = time(NULL);
    tm = localtime(&t);

    if (flag == 0)
    {
        sprintf(tmp_str, "  %02d:%02d ", tm->tm_hour, tm->tm_min);
    }
    else
    {
        sprintf(tmp_str, "  %02d %02d ", tm->tm_hour, tm->tm_min);
    }

    str = tmp_str;
}

void printTimeLEDMatrix()
{
    uint8_t time_font_buf[8][16] = {0};
    String str;

    static int flag = 0;

    flag = ~flag;
    PrintTime(str, flag);

    uint8_t time_font_color[8] = {O, O, G, G, O, G, G, O};
    uint16_t sj_length = SFR.StrDirect_ShinoFNT_readALL(str, time_font_buf);
    printLEDMatrix(sj_length, time_font_buf, time_font_color);
}

void blink()
{
    printTimeLEDMatrix();
}

void connecting()
{
    uint16_t sj_length = 0;
    uint8_t _font_buf[8][16] = {0};
    uint8_t _font_color[8] = {O, O, O, O, O, O, O, O};

    static int num = 0;

    num = ~num;

    if (num)
    {
        sj_length = SFR.StrDirect_ShinoFNT_readALL("        ", _font_buf);
        printLEDMatrix(sj_length, _font_buf, _font_color);
    }
    else
    {
        sj_length = SFR.StrDirect_ShinoFNT_readALL("       .", _font_buf);
        printLEDMatrix(sj_length, _font_buf, _font_color);
    }
}

void printConnected()
{
    uint16_t sj_length = 0;
    uint8_t font_buf[32][16] = {0};
    uint8_t font_color1[32] = {G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G};

    sj_length = SFR.StrDirect_ShinoFNT_readALL(MSG_CONNECTED, font_buf);
    scrollLEDMatrix(sj_length, font_buf, font_color1, 30);

    sj_length = SFR.StrDirect_ShinoFNT_readALL("        " + WiFi.localIP().toString(), font_buf);
    scrollLEDMatrix(sj_length, font_buf, font_color1, 30);
}

void print_blank()
{
    uint8_t _font_buf[8][16] = {0};
    uint8_t _font_color[8] = {G, G, G, G, G, G, G, G};
    printLEDMatrix(8, _font_buf, _font_color);
}

void clearLEDMatrix()
{
    print_blank();
    print_blank();
}

void printStatic(String str)
{
    uint8_t _font_buf[8][16] = {0};
    uint8_t _font_color[8] = {G, G, G, G, G, G, G, G};

    if (str.length() < 9)
    {
        log_i("str : %s", str.c_str());
        uint16_t sj_length = SFR.StrDirect_ShinoFNT_readALL(str, _font_buf);
        printLEDMatrix(sj_length, _font_buf, _font_color);
    }
    else
    {
        log_e("couldn't set string. string length : %d", str.length());
    }
}

void initFont()
{
    SFR.SPIFFS_Shinonome_Init3F(UTF8SJIS_FILE.c_str(), SHINO_HALF_FONT_FILE.c_str(), DUMMY.c_str());
}

void initLEDMatrix()
{
    initFont();

    setAllPortOutput();

    digitalWrite(PORT_SE_IN, HIGH); //to change manual mode
    print_blank();
    print_blank();
}

bool check_clock_enable(uint8_t start_hour, uint8_t end_hour)
{
    time_t t = time(NULL);
    struct tm *tm = localtime(&t);

    log_i("HH:MM:SS = %02d:%02d:%02d", tm->tm_hour, tm->tm_min, tm->tm_sec);

    if (start_hour <= tm->tm_hour && tm->tm_hour < end_hour)
    {
        return true;
    }
    else
    {
        return false;
    }
}

void checkSensor()
{
    message = MESSAGE::MSG_COMMAND_SENSOR;
}

void stopClock()
{
    clocker.detach();
    sensor_checker.detach();
    active = false;
}

void startClock()
{
    clocker.attach_ms(500, blink);
    sensor_checker.attach(60, checkSensor);
    active = true;
}

void check_clock()
{
    bool IsClock = check_clock_enable(CLOCK_EN_S, CLOCK_EN_E);

    if (IsClock == true)
    {
        if (active == false)
        {
            startClock();
            active = true;
        }
    }
    else
    {
        if (active == true)
        {
            stopClock();
            clearLEDMatrix();
            active = false;
        }
    }
}

String getServerInfo(String hostName, String uri)
{
    String jsonBody;
    HTTPClient http;

    log_d("Starting connection to %s.local Web server...", hostName.c_str());

    IPAddress ip = MDNS.queryHost(hostName);
    log_i("Hostname : %s IPaddress : %s", hostName.c_str(), ip.toString().c_str());

    http.begin(ip.toString(), 80, uri);
    int httpCode = http.GET();

    if (httpCode < 0)
    {
        log_e("Connection failed! code : %d", httpCode);
        jsonBody = "";
    }
    else
    {
        log_i("Connected to server! code : %d", httpCode);
        jsonBody = http.getString();
    }

    if (http.connected())
    {
        http.end();
    }

    return jsonBody;
}

void initClock()
{
    //Get NTP Time
    configTzTime("JST-9", "ntp.nict.jp", "ntp.jst.mfeed.ad.jp");

    delay(2000);

    check_clock();

    checker.attach(60, check_clock);
}

void printTemperature()
{
    String temperature;
    char buffer[10] = {0};

    float _temperature = doc["temperatur"]; // 21.93

    snprintf(buffer, 9, "T:%4.1f*C", _temperature);
    temperature = buffer;
    log_i("temperature : [%s]", temperature.c_str());

    printStatic(temperature);

    delay(3000);
}

void printPressur()
{
    String pressur;
    char buffer[10] = {0};

    float _pressur = doc["pressur"]; // 1015.944

    snprintf(buffer, 9, "P:%6.1f", _pressur);
    pressur = buffer;
    log_i("pressur : [%s]", pressur.c_str());

    printStatic(pressur);

