riraosan/ESP32_LEDMatrix_Clock/src/main.cpp
    delay(3000);
}

void printHumidity()
{
    String humidity;
    char buffer[10] = {0};

    float _humidity = doc["humidity"]; // 39.27832

    snprintf(buffer, 9, "H:%5.1f%%", _humidity);
    humidity = buffer;
    log_i("humidity : [%s]", humidity.c_str());

    printStatic(humidity);

    delay(3000);
}

void getBME280Info()
{
    String json = getServerInfo(DIST_HOSTNAME, APIURI);
    if (json.isEmpty())
    {
        if (retry < 2)
        {
            retry++;
            checkSensor();
            delay(3000);
            return;
        }
        else
        {
            retry = 0;
            message = MESSAGE::MSG_COMMAND_NOTHING;
            return;
        }
    }
    else
    {
        retry = 0;

        stopClock();

        log_d("Body = %s", json.c_str());
        deserializeJson(doc, json);

        message = MESSAGE::MSG_COMMAND_TEMPERATURE;
    }
}

static void notifyCallback(BLERemoteCharacteristic *pBLERemoteCharacteristic, uint8_t *pData, size_t length, bool isNotify)
{
    log_i("Notify callback for characteristic %s of data length %d", pBLERemoteCharacteristic->getUUID().toString().c_str(), length);
}

class MyClientCallback : public BLEClientCallbacks
{
    void onConnect(BLEClient *pclient)
    {
        log_i("onConnect");
        message = MESSAGE::MSG_COMMAND_BLE_CONNECTED;
    }

    void onDisconnect(BLEClient *pclient)
    {
        log_i("onDisconnect");
        message = MESSAGE::MSG_COMMAND_BLE_DISCONNECTED;
    }
};

bool connectToServer(BLEAddress pAddress)
{
    log_i("Forming a connection to %s", pAddress.toString().c_str());

    BLEClient *pClient = BLEDevice::createClient();
    log_i(" - Created client");

    pClient->setClientCallbacks(new MyClientCallback());

    // Connect to the remove BLE Server.
    pClient->connect(pAddress);
    log_i(" - Connected to server");

    // Obtain a reference to the service we are after in the remote BLE server.
    BLERemoteService *pRemoteService = pClient->getService(serviceUUID);
    if (pRemoteService == nullptr)
    {
        log_i("Failed to find our service UUID: %s", serviceUUID.toString().c_str());
        return false;
    }
    log_i(" - Found our service");

    // Obtain a reference to the characteristic in the service of the remote BLE server.
    pRemoteCharacteristic = pRemoteService->getCharacteristic(charUUID);
    if (pRemoteCharacteristic == nullptr)
    {
        log_i("Failed to find our characteristic UUID: %s", charUUID.toString().c_str());
        return false;
    }

    log_i(" - Found our characteristic");

    // Read the value of the characteristic.
    std::string value = pRemoteCharacteristic->readValue();
    log_i("The characteristic value was: %s", value.c_str());

    pRemoteCharacteristic->registerForNotify(notifyCallback);

    return true;
}

/**
 * Scan for BLE servers and find the first one that advertises the service we are looking for.
 */
class MyAdvertisedDeviceCallbacks : public BLEAdvertisedDeviceCallbacks
{
    /**
   * Called for each advertising BLE server.
   */
    void onResult(BLEAdvertisedDevice advertisedDevice)
    {
        log_i("BLE Advertised Device found: %s", advertisedDevice.toString().c_str());

        // We have found a device, let us now see if it contains the service we are looking for.
        if (advertisedDevice.haveServiceUUID() && advertisedDevice.getServiceUUID().equals(serviceUUID))
        {
            log_i("Found our device!  address: %s", advertisedDevice.getAddress().toString().c_str());
            advertisedDevice.getScan()->stop();

            pServerAddress = new BLEAddress(advertisedDevice.getAddress());
            message = MESSAGE::MSG_COMMAND_BLE_DO_CONNECT;

        } // Found our server
        else
        {
            message = MESSAGE::MSG_COMMAND_BLE_NOT_FOUND;
        } // Not found our server
    }     // onResult
};        // MyAdvertisedDeviceCallbacks

static MyAdvertisedDeviceCallbacks *pAdvertisedDeviceCallback;

void initBLE()
{
    log_i("Starting Arduino BLE Client application...");

    BLEDevice::deinit();

    BLEDevice::init("");
    // Retrieve a Scanner and set the callback we want to use to be informed when we
    // have detected a new device.  Specify that we want active scanning and start the
    // scan to run for 30 seconds.
    BLEScan *pBLEScan = BLEDevice::getScan();
    pAdvertisedDeviceCallback = new MyAdvertisedDeviceCallbacks();

    pBLEScan->setAdvertisedDeviceCallbacks(pAdvertisedDeviceCallback);
    pBLEScan->setActiveScan(true);
    pBLEScan->start(30); //waitting to find BLE server
}

String makeCreateTime()
{
    time_t t = time(NULL);
    struct tm *tm = localtime(&t);

    char buffer[128] = {0};
    sprintf(buffer, "%04d-%02d-%02dT%02d:%02d:%02d+0900",
            tm->tm_year + 1900,
            tm->tm_mon + 1,
            tm->tm_mday,
            tm->tm_hour,
            tm->tm_min,
            tm->tm_sec);

    String createTime(buffer);

    log_i("[time] %s", createTime.c_str());

    return createTime;
}

String getSensorDeviceName()
{
    return "BME280";
}

const char HEX_CHAR_ARRAY[17] = "0123456789ABCDEF";
/**
* convert char array (hex values) to readable string by seperator
* buf:           buffer to convert
* length:        data length
* strSeperator   seperator between each hex value
* return:        formated value as String
*/
String byteToHexString(uint8_t *buf, uint8_t length, String strSeperator = "-")
{
    String dataString = "";
    for (uint8_t i = 0; i < length; i++)
    {
        byte v = buf[i] / 16;
        byte w = buf[i] % 16;
        if (i > 0)
        {
            dataString += strSeperator;
        }
        dataString += String(HEX_CHAR_ARRAY[v]);
        dataString += String(HEX_CHAR_ARRAY[w]);
    }
    dataString.toUpperCase();
    return dataString;
} // byteToHexString

String _getESP32ChipID()
{
    uint64_t chipid;
    chipid = ESP.getEfuseMac(); //The chip ID is essentially its MAC address(length: 6 bytes).
    int chipid_size = 6;
    uint8_t chipid_arr[chipid_size];
    for (uint8_t i = 0; i < chipid_size; i++)
    {
        chipid_arr[i] = (chipid >> (8 * i)) & 0xff;
    }
    return byteToHexString(chipid_arr, chipid_size, "");
}

void setJsonResponse(String selfApiURI, String nextApiURI, String status)
{
    _root["cip_id"] = _getESP32ChipID();
    _root["created_at"] = makeCreateTime();

