riraosan/ESP32_LEDMatrix_Clock/src/main.cpp
    JsonObject _links = _root.createNestedObject("_links");

    _links["self"]["href"] = selfApiURI;
    _links["next"]["href"] = nextApiURI;

    JsonObject _embedded_sensor_1 = _root["_embedded"]["sensor"].createNestedObject("1");
    _embedded_sensor_1["temperature"] = doc["temperatur"];
    _embedded_sensor_1["humidity"] = doc["humidity"];
    _embedded_sensor_1["pressure"] = doc["pressur"];
    _embedded_sensor_1["status"] = status;
}

void initWebServer()
{
    g_server->on(sensors_all.c_str(), HTTP_GET, [](AsyncWebServerRequest *request) {
        log_d("[HTTP_GET] %s", sensors_all.c_str());
        String response;
        serializeJson(_root, response);
        request->send(200, "application/json; charset=UTF-8", response);
    });

    g_server->on(sensors_temperature.c_str(), HTTP_GET, [](AsyncWebServerRequest *request) {
        log_d("[HTTP_GET] %s", sensors_temperature.c_str());

        request->send(200, "application/json; charset=UTF-8", "{\"code\": 200}");
    });

    g_server->on(sensors_humidity.c_str(), HTTP_GET, [](AsyncWebServerRequest *request) {
        log_d("[HTTP_GET] %s", sensors_humidity.c_str());

        request->send(200, "application/json; charset=UTF-8", "{\"code\": 200}");
    });

    g_server->on(sensors_pressure.c_str(), HTTP_GET, [](AsyncWebServerRequest *request) {
        log_d("[HTTP_GET] %s", sensors_pressure.c_str());

        request->send(200, "application/json; charset=UTF-8", "{\"code\": 200}");
    });
}

void setup()
{
    initLEDMatrix();

    blinker.attach_ms(500, connecting);

    stb.setHostname(HOSTNAME);
    stb.setTargetHostname(DIST_HOSTNAME);
    stb.setApName(AP_NAME);

    stb.begin();

    blinker.detach();

    printConnected();

    initClock();
    initWebServer();
}

void loop()
{

    stb.handle();

    switch (message)
    {
    case MESSAGE::MSG_COMMAND_SENSOR:
        getBME280Info();
        break;
    case MESSAGE::MSG_COMMAND_TEMPERATURE:

        printTemperature();
        message = MESSAGE::MSG_COMMAND_HUMIDITY;
        break;
    case MESSAGE::MSG_COMMAND_HUMIDITY:

        printHumidity();
        message = MESSAGE::MSG_COMMAND_PRESSURE;
        break;
    case MESSAGE::MSG_COMMAND_PRESSURE:

        printPressur();
        message = MESSAGE::MSG_COMMAND_CLOCK;
        break;
    case MESSAGE::MSG_COMMAND_CLOCK:

        startClock();
        message = MESSAGE::MSG_COMMAND_NOTHING;
        break;
    case MESSAGE::MSG_COMMAND_BLE_INIT:
        initBLE();
        break;
    case MESSAGE::MSG_COMMAND_BLE_DO_CONNECT:
        log_i("We wish to connect BLE Server. pServerAddress = 0x%x", pServerAddress);
        // We have scanned for and found the desired BLE Server with which we wish to connect.
        // Now we connect to it. Once we are connected we set "MSG_COMMAND_BLE_CONNECTED"
        if (connectToServer(*pServerAddress))
        {
            log_i("We are now connected to the BLE Server");
            message = MESSAGE::MSG_COMMAND_BLE_CONNECTED;
        }
        else
        {
            log_i("We have failed to connect to the server; there is nothing more we will do.");
            message = MESSAGE::MSG_COMMAND_BLE_DISCONNECTED;
        }
        break;
    case MESSAGE::MSG_COMMAND_BLE_CONNECTED:
        log_i("We are connected to a peer BLE Server");
        // If we are connected to a peer BLE Server, update the characteristic each time we are reached
        // with the current time since boot.

        //String newValue = "Time since boot: " + String(millis() / 1000);
        //log_i("Setting new characteristic value to \"%s\"", newValue.c_str());

        // Set the characteristic's value to be the array of bytes that is actually a string.
        //pRemoteCharacteristic->writeValue(newValue.c_str(), newValue.length());
        message = MESSAGE::MSG_COMMAND_NOTHING;
        break;
    case MESSAGE::MSG_COMMAND_BLE_DISCONNECTED:
        log_i("Disconnected our service");

        //TODO LED ON or OFF? To indicate for human.
        message = MESSAGE::MSG_COMMAND_BLE_INIT;
        break;
    case MESSAGE::MSG_COMMAND_BLE_NOT_FOUND:
        log_i("Not found our service");

        //TODO LED ON or OFF? To indicate for human.
        message = MESSAGE::MSG_COMMAND_NOTHING;
        break;
    case MESSAGE::MSG_COMMAND_NOTHING:
    default:; //nothing
    }

    yield();
}
